Repository: danny270793/SpaceUssager
Catalog: SpaceUssager/*.lproj/Localizable.strings
Languages: es

# button.selectFolder
source: Select Folder
es: Seleccionar Carpeta

# button.parentFolder
source: Parent Folder
es: Carpeta Superior

# welcome.title
source: Welcome to Space Ussager
es: Bienvenido a Space Ussager

# welcome.subtitle
source: Analyze and understand your disk space usage
es: Analiza y comprende el uso de espacio en tu disco

# welcome.feature1.title
source: Scan Any Folder
es: Escanea Cualquier Carpeta

# welcome.feature1.description
source: Quickly analyze the contents of any folder on your Mac
es: Analiza rápidamente el contenido de cualquier carpeta en tu Mac

# welcome.feature2.title
source: See File Sizes
es: Ver Tamaños de Archivos

# welcome.feature2.description
source: View files and folders sorted by size to identify space hogs
es: Visualiza archivos y carpetas ordenados por tamaño para identificar archivos grandes

# welcome.feature3.title
source: Search & Filter
es: Buscar y Filtrar

# welcome.feature3.description
source: Find specific files and folders with instant search
es: Encuentra archivos y carpetas específicos con búsqueda instantánea

# welcome.feature4.title
source: Easy Navigation
es: Navegación Fácil

# welcome.feature4.description
source: Navigate through your folder structure with ease
es: Navega por la estructura de carpetas con facilidad

# welcome.getStarted
source: Get Started
es: Comenzar

# empty.noFolder
source: No folder selected
es: Ninguna carpeta seleccionada

# empty.instruction
source: Click 'Select Folder' to analyze disk usage
es: Haz clic en 'Seleccionar Carpeta' para analizar el uso del disco

# scanning.text
source: Scanning...
es: Escaneando...

# scanning.path
source: Scanning: %@
es: Escaneando: %@

# bottom.totalSize
source: Total Size:
es: Tamaño Total:

# bottom.stats
source: (%d files, %d folders)
es: (%d archivos, %d carpetas)

# search.prompt
source: Search files and folders
es: Buscar archivos y carpetas

# search.results
source: %d of %d
es: %d de %d

# contextMenu.showInFinder
source: Show in Finder
es: Mostrar en Finder

# contextMenu.delete
source: Move to Trash
es: Mover a la Papelera

# delete.confirmation.title
source: Move to Trash
es: Mover a la Papelera

# delete.confirmation.message
source: Are you sure you want to move "%@" to the Trash?
es: ¿Estás seguro de que deseas mover "%@" a la Papelera?

# delete.confirmation.button
source: Move "%@" to Trash
es: Mover "%@" a la Papelera

# delete.confirmation.cancel
source: Cancel
es: Cancelar

# delete.error.title
source: Failed to Move to Trash
es: Error al Mover a la Papelera

# log.scan.starting
source: Starting scan of: %@
es: Iniciando escaneo de: %@

# log.scan.deallocated
source: Self was deallocated, aborting scan
es: Self fue desasignado, abortando escaneo

# log.scan.failed
source: Failed to read directory contents: %@
es: Error al leer contenido del directorio: %@

# log.scan.reason
source: Reason: %@
es: Razón: %@

# log.scan.found
source: Found %d items to process
es: Se encontraron %d elementos para procesar

# log.scan.file
source: File: %@ - %@
es: Archivo: %@ - %@

# log.scan.folderFound
source: Folder found: %@ - calculating size...
es: Carpeta encontrada: %@ - calculando tamaño...

# log.scan.folderComplete
source: Folder: %@ - %@ (took %.2fs)
es: Carpeta: %@ - %@ (tomó %.2fs)

# log.scan.error
source: Error reading item: %@
es: Error al leer elemento: %@

# log.scan.completed
source: Scan completed!
es: ¡Escaneo completado!

# log.scan.stats
source: Files: %d, Folders: %d
es: Archivos: %d, Carpetas: %d

# log.nav.parentRequested
source: Go to parent requested
es: Solicitud de ir a carpeta superior

# log.nav.noPath
source: No current path, cannot go to parent
es: No hay ruta actual, no se puede ir a la carpeta superior

# log.nav.current
source: Current: %@
es: Actual: %@

# log.nav.parent
source: Parent: %@
es: Superior: %@

# log.nav.navigating
source: Navigating to parent
es: Navegando a carpeta superior

# log.nav.cannotNavigate
source: Cannot navigate to parent (at root or invalid)
es: No se puede navegar a la carpeta superior (en raíz o inválida)

# log.ui.selectFolderClicked
source: Select Folder button clicked
es: Botón Seleccionar Carpeta presionado

# log.ui.selectFolderBlocked
source: Select Folder blocked - scan in progress
es: Seleccionar Carpeta bloqueado - escaneo en progreso

# log.ui.parentClicked
source: '..' item clicked
es: Elemento '..' presionado

# log.ui.parentBlocked
source: '..' blocked - scan in progress
es: '..' bloqueado - escaneo en progreso

# log.ui.folderClicked
source: Folder clicked: %@
es: Carpeta presionada: %@

# log.ui.folderBlocked
source: Folder click blocked - scan in progress
es: Clic en carpeta bloqueado - escaneo en progreso

# log.ui.fileClicked
source: File clicked (no action): %@
es: Archivo presionado (sin acción): %@

# log.ui.scrolling
source: Scrolling to top for: %@
es: Desplazando al inicio para: %@

# log.ui.showInFinderClicked
source: Show in Finder requested for: %@
es: Mostrar en Finder solicitado para: %@

# log.ui.deleteClicked
source: Move to Trash requested for: %@
es: Mover a la Papelera solicitado para: %@

# log.picker.callback
source: File picker callback triggered
es: Callback del selector de archivos activado

# log.picker.selected
source: Folder selected: %@
es: Carpeta seleccionada: %@

# log.picker.access
source: Security-scoped access: %@
es: Acceso de seguridad: %@

# log.picker.access.granted
source: granted
es: concedido

# log.picker.access.notNeeded
source: not needed
es: no necesario

# log.picker.noAccess
source: Attempting scan without security scope
es: Intentando escaneo sin ámbito de seguridad

# log.picker.noUrl
source: No folder URL returned
es: No se devolvió URL de carpeta

# log.picker.error
source: Error selecting folder: %@
es: Error al seleccionar carpeta: %@

# log.delete.attempting
source: Attempting to move to trash: %@
es: Intentando mover a la papelera: %@

# log.delete.success
source: Successfully moved to trash: %@
es: Movido a la papelera exitosamente: %@

# log.delete.failed
source: Failed to move to trash: %@
es: Error al mover a la papelera: %@

# log.delete.reason
source: Reason: %@
es: Razón: %@

# menu.help.spaceussager
source: SpaceUssager Help
es: Ayuda de SpaceUssager

# help.window.title
source: Help
es: Ayuda

# help.title
source: SpaceUssager Help
es: Ayuda de SpaceUssager

# help.subtitle
source: Learn how to analyze your disk space
es: Aprende a analizar el espacio en tu disco

# help.gettingStarted.title
source: Getting Started
es: Comenzando

# help.gettingStarted.step1.title
source: Select a Folder
es: Seleccionar una Carpeta

# help.gettingStarted.step1.description
source: Click the 'Select Folder' button in the toolbar or press ⌘O to choose a folder to analyze.
es: Haz clic en el botón 'Seleccionar Carpeta' en la barra de herramientas o presiona ⌘O para elegir una carpeta para analizar.

# help.gettingStarted.step2.title
source: Wait for Scan
es: Esperar el Escaneo

# help.gettingStarted.step2.description
source: The app will scan the folder and calculate sizes. Large folders may take a few moments.
es: La aplicación escaneará la carpeta y calculará los tamaños. Las carpetas grandes pueden tomar unos momentos.

# help.gettingStarted.step3.title
source: Explore Results
es: Explorar Resultados

# help.gettingStarted.step3.description
source: Files and folders are sorted by size, with the largest items at the top.
es: Los archivos y carpetas están ordenados por tamaño, con los elementos más grandes en la parte superior.

# help.navigation.title
source: Navigation
es: Navegación

# help.navigation.enterFolder.title
source: Enter a Folder
es: Entrar en una Carpeta

# help.navigation.enterFolder.description
source: Click on any folder in the list to navigate into it and see its contents.
es: Haz clic en cualquier carpeta de la lista para navegar hacia ella y ver su contenido.

# help.navigation.goBack.title
source: Go Back
es: Volver Atrás

# help.navigation.goBack.description
source: Click the '..' item at the top of the list to go back to the parent folder.
es: Haz clic en el elemento '..' en la parte superior de la lista para volver a la carpeta superior.

# help.navigation.breadcrumb.title
source: Current Path
es: Ruta Actual

# help.navigation.breadcrumb.description
source: The current folder path is always displayed at the top of the window.
es: La ruta de la carpeta actual siempre se muestra en la parte superior de la ventana.

# help.features.title
source: Features
es: Características

# help.features.search.title
source: Search
es: Búsqueda

# help.features.search.description
source: Use the search bar in the toolbar to filter files and folders by name. Press ⌘F to focus the search.
es: Usa la barra de búsqueda en la barra de herramientas para filtrar archivos y carpetas por nombre. Presiona ⌘F para enfocar la búsqueda.

# help.features.sizes.title
source: Size Display
es: Visualización de Tamaños

# help.features.sizes.description
source: File sizes are shown in human-readable format (KB, MB, GB). Folder sizes include all their contents.
es: Los tamaños de archivo se muestran en formato legible (KB, MB, GB). Los tamaños de carpeta incluyen todo su contenido.

# help.features.stats.title
source: Statistics
es: Estadísticas

# help.features.stats.description
source: The bottom bar shows total size, file count, and folder count for the current view.
es: La barra inferior muestra el tamaño total, conteo de archivos y conteo de carpetas para la vista actual.

# help.features.progressive.title
source: Progressive Loading
es: Carga Progresiva

# help.features.progressive.description
source: Results appear as they're scanned, so you can start exploring immediately.
es: Los resultados aparecen mientras se escanean, para que puedas comenzar a explorar inmediatamente.

# help.shortcuts.title
source: Keyboard Shortcuts
es: Atajos de Teclado

# help.shortcuts.open
source: Open folder selector
es: Abrir selector de carpetas

# help.shortcuts.search
source: Focus search field
es: Enfocar campo de búsqueda

# help.shortcuts.help
source: Show this help window
es: Mostrar esta ventana de ayuda

# help.tips.title
source: Tips
es: Consejos

# help.tips.tip1
source: Wait for the scan to complete before navigating to get accurate sizes
es: Espera a que se complete el escaneo antes de navegar para obtener tamaños precisos

# help.tips.tip2
source: Use search to quickly find specific files or folders
es: Usa la búsqueda para encontrar rápidamente archivos o carpetas específicos

# help.tips.tip3
source: The largest files appear at the top - perfect for finding space hogs
es: Los archivos más grandes aparecen en la parte superior - perfecto para encontrar archivos grandes

# help.tips.tip4
source: Hidden files are not shown in the results
es: Los archivos ocultos no se muestran en los resultados
